# FaceDetailNode Properties

---
The FaceDetailNode type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode)
| LineProperties|  Access to the line (pen) properties of the curve being drawn.
| NodeName|  A readable name of the output node. (Inherited from RenderNode)
Top
#### Reference
FaceDetailNode Class
Autodesk.Revit.DB Namespace